Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: the filling (405) a packaging layer in the window comprises: enabling the electrical signal layer to be insulated and adjacent to a side that is of the glass substrate layer and that is away from the metal layer.
de_de: das Ausfüllen (405) einer Verpackungsschicht in dem Fenster umfasst: Ermöglichen, dass die elektrische Signalschicht isoliert ist und einer Seite, die aus der Glassubstratschicht besteht und von der Metallschicht abgewandt ist, benachbart ist.

source: 9. The preparation method according to claim 8, wherein the filling a packaging layer in the window comprises: hermetically connecting the packaging layer to the electrical signal layer at the window through hot pressing.
de_de: 9. Herstellungsverfahren nach Anspruch 8, wobei das Füllen einer Verpackungsschicht in dem Fenster umfasst: luftdichtes Verbinden der Verpackungsschicht mit der elektrischen Signalschicht an dem Fenster durch Heißpressen.

source: An optical communication device (100), comprising the hermetic apparatus (10) according to claim 6 and a drive board (30), wherein the hermetic apparatus is a wavelength selective switch, and a second end of a flexible circuit board exposed outside a hermetic housing is electrically connected to the drive board through an electrical connector.
de_de: Optische Kommunikationsvorrichtung (100), umfassend die luftdichte Vorrichtung (10) nach Anspruch 6 und eine Treiberplatine (30), wobei die luftdichte Vorrichtung ein wellenlängenselektiver Schalter ist und ein zweites Ende einer flexiblen Leiterplatte, das außerhalb eines luftdichten Gehäuses freiliegt, über einen elektrischen Verbinder elektrisch mit der Treiberplatine verbunden ist.

source: 1. An electrical device, comprising a substrate (600), wherein
de_de: 1. Elektrische Vorrichtung, umfassend ein Substrat (600), wobei

source: two power terminals (100) are disposed at an interval along a first direction on the substrate (600), each power terminal (100) is electrically connected to a power circuit (200);
de_de: zwei Leistungsendgeräte (100) in einem Intervall entlang einer ersten Richtung auf dem Substrat (600) angeordnet sind, wobei jedes Leistungsendgerät (100) elektrisch mit einer Leistungsschaltung (200) verbunden ist;

source: at least one of the power terminals (100) comprises a first conductive section (110), a resistor, and a second conductive section (130); and
de_de: mindestens eines der Leistungsendgeräte (100) einen ersten leitfähigen Abschnitt (110), einen Widerstand und einen zweiten leitfähigen Abschnitt (130) umfasst; und

source: in the same power terminal (100), the first conductive section (110), the resistor, and the second conductive section (130) are connected in series, the first conductive section (110) is electrically connected, by using the resistor and the second conductive section (130), to the power circuit (200), both the first conductive section (110) and the second conductive section (130) are located on a surface on a same side of the substrate (600), and in an insertion direction of the substrate (600), the first conductive section (110) is disposed at an interval in front of the second conductive section (130), so that the first conductive section (110) is disconnected from the second conductive section (130) in the insertion direction of the substrate (600); wherein
de_de: in dem selben Leistungsendgerät (100) der erste leitende Abschnitt (110), der Widerstand und der zweite leitende Abschnitt (130) in Reihe geschaltet sind, der erste leitende Abschnitt (110) mithilfe des Widerstands und des zweiten leitenden Abschnitts (130) elektrisch mit der Leistungsschaltung (200) verbunden ist, sowohl der erste leitende Abschnitt (110) als auch der zweite leitende Abschnitt (130) sich auf einer Oberfläche auf einer selben Seite des Substrats (600) befinden und in einer Einschubrichtung des Substrats (600) der erste leitende Abschnitt (110) in einem Intervall vor dem zweiten leitenden Abschnitt (130) angeordnet ist, sodass der erste leitende Abschnitt (110) in der Einschubrichtung des Substrats (600) von dem zweiten leitenden Abschnitt (130) getrennt ist; wobei

source: the first direction is perpendicular to the insertion direction of the substrate (600), characterized in that
de_de: die erste Richtung senkrecht zu der Einschubrichtung des Substrats (600) ist, dadurch gekennzeichnet, dass

source: capacitors are disposed between the two power circuits (200), one end of the capacitor is electrically connected to one power circuit (200), and another end of the capacitor is electrically connected to the other power circuit (200); one of the two power terminals (100) is a first power terminal (140), the other is a second power terminal (150), and the first power terminal (140) comprises the first conductive section (110), the resistor, and the second conductive section (130); and wherein a spacing between the first conductive section (110) of the first power terminal (140) and the second power terminal (150) is greater than a spacing between the second conductive section (130) of the first power terminal (140) and the second power terminal (150) in the first direction.
de_de: Kondensatoren zwischen den zwei Leistungsschaltungen (200) angeordnet sind, ein Ende des Kondensators elektrisch mit einer Leistungsschaltung (200) verbunden ist und ein anderes Ende des Kondensators elektrisch mit der anderen Leistungsschaltung (200) verbunden ist; einer der beiden Leistungsendgeräte (100) ein erstes Leistungsendgerät (140) ist, das andere ein zweites Leistungsendgerät (150) ist und das erste Leistungsendgerät (140) den ersten leitfähigen Abschnitt (110), den Widerstand und den zweiten leitfähigen Abschnitt (130) umfasst; und wobei ein Abstand zwischen dem ersten leitfähigen Abschnitt (110) des ersten Leistungsendgeräts (140) und dem zweiten Leistungsendgerät (150) in der ersten Richtung größer ist als ein Abstand zwischen dem zweiten leitfähigen Abschnitt (130) des ersten Leistungsendgeräts (140) und dem zweiten Leistungsendgerät (150).

source: 2. The electrical device according to claim 1, wherein in the same power terminal (100), a projection of the first conductive section (110) along the insertion direction of the substrate (600) at least partially overlaps with a projection of the second conductive section (130) along the insertion direction of the substrate (600).
de_de: 2. Elektrische Vorrichtung nach Anspruch 1, wobei sich in dem gleichen Leistungsendgerät (100) eine Projektion des ersten leitfähigen Abschnitts (110) entlang der Einschubrichtung des Substrats (600) mindestens teilweise mit einer Projektion des zweiten leitfähigen Abschnitts (130) entlang der Einschubrichtung des Substrats (600) überlappt.

source: 3. The electrical device according to claim 2, wherein in the same power terminal (100), the projection of the first conductive section (110) along the insertion direction of the substrate (600) falls within the projection of the second conductive section (130) along the insertion direction of the substrate (600).
de_de: 3. Elektrische Vorrichtung nach Anspruch 2, wobei in dem selben Leistungsendgerät (100) die Projektion des ersten leitfähigen Abschnitts (110) entlang der Einschubrichtung des Substrats (600) mindestens teilweise innerhalb der Projektion des zweiten leitfähigen Abschnitts (130) entlang der Einschubrichtung des Substrats (600) fällt.

source: 4. The electrical device according to any one of claims 1 to 3, wherein the substrate (600) comprises a printed circuit board (610), and the two power terminals (100) are disposed at the interval along the first direction on the printed circuit board (610); and
de_de: 4. Elektrische Vorrichtung nach einem der Ansprüche 1 bis 3, wobei das Substrat (600) eine Leiterplatte (610) umfasst und die zwei Leistungsendgeräte (100) in dem Intervall entlang der ersten Richtung auf der Leiterplatte (610) angeordnet sind; und

source: both the first conductive section (110) and the second conductive section (130) are located on a surface on a same side of the printed circuit board (610), and the power circuit (200) is located at least partially on the printed circuit board (610).
de_de: sowohl der erste leitfähige Abschnitt (110) als auch der zweite leitfähige Abschnitt (130) sich auf einer Oberfläche auf einer selben Seite der Leiterplatte (610) befinden und die Leistungsschaltung (200) sich mindestens teilweise auf der Leiterplatte (610) befindet.

source: 5. The electrical device according to claim 4, wherein the resistor is disposed on the printed circuit board (610).
de_de: 5. Elektrische Vorrichtung nach Anspruch 4, wobei der Widerstand auf der Leiterplatte (610) angeordnet ist.

source: 6. The electrical device according to any one of claims 1 to 3, wherein both the first conductive section (110) and the second conductive section (130) are strip-shaped conductive sheets extending along the insertion direction of the substrate (600).
de_de: 6. Elektrische Vorrichtung nach einem der Ansprüche 1 bis 3, wobei sowohl der erste leitfähige Abschnitt (110) als auch der zweite leitfähige Abschnitt (130) streifenförmige leitfähige Flachteile sind, die sich entlang der Einschubrichtung des Substrats (600) erstrecken.

source: 7. The electrical device according to claim 1, wherein in the first direction, a width of the first conductive section (110) of the first power terminal (140) is less than a width of the second conductive section (130) of the first power terminal (140); and/or
de_de: 7. Elektrische Vorrichtung nach Anspruch 1, wobei in der ersten Richtung eine Breite des ersten leitfähigen Abschnitts (110) des ersten Leistungsendgeräts (140) geringer ist als eine Breite des zweiten leitfähigen Abschnitts (130) des ersten Leistungsendgeräts (140); und/oder

source: in the first direction, a width of a part that is of the second power terminal (150) and that is opposite to the first conductive section (110) of the first power terminal (140) is less than a width of a part that is of the second power terminal (150) and that is opposite to the second conductive section (130) of the first power terminal (140).
de_de: in der ersten Richtung eine Breite eines Teils, der von dem zweiten Leistungsendgerät (150) ist und der dem ersten leitfähigen Abschnitt (110) des ersten Leistungsendgeräts (140) gegenüberliegt, geringer ist als eine Breite eines Teils, der von dem zweiten Leistungsendgerät (150) ist und der dem zweiten leitfähigen Abschnitt (130) des ersten Leistungsendgeräts (140) gegenüberliegt.

source: 8. The electrical device according to any one of claims 1 to 3, wherein in the same power terminal (100), a length of the first conductive section (110) along the insertion direction of the substrate (600) is less than a length of the second conductive section (130) along the insertion direction of the substrate (600).
de_de: 8. Elektrische Vorrichtung nach einem der Ansprüche 1 bis 3, wobei in dem selben Leistungsendgerät (100) eine Länge des ersten leitfähigen Abschnitts (110) entlang der Einschubrichtung des Substrats (600) geringer ist als eine Länge des zweiten leitfähigen Abschnitts (130) entlang der Einschubrichtung des Substrats (600).

source: 9. The electrical device according to any one of claims 1 to 3, wherein each of the two power terminals (100) comprises the first conductive section (110), the resistor, and the second conductive section (130); and
de_de: 9. Elektrische Vorrichtung nach einem der Ansprüche 1 bis 3, wobei jedes der zwei Leistungsendgeräte (100) den ersten leitfähigen Abschnitt (110), den Widerstand und den zweiten leitfähigen Abschnitt (130) umfasst; und

source: in the first direction, the first conductive sections (110) of the two power terminals (100) are disposed as being opposite to each other in the front of the insertion direction of the substrate (600).
de_de: die ersten leitfähigen Abschnitte (110) der zwei Leistungsendgeräte (100) in der ersten Richtung einander gegenüberliegend vor der Einsteckrichtung des Substrats (600) angeordnet sind.

source: The electrical device according to any one of claims 1 to 3, wherein the power circuit (200) is electrically connected to one of the power terminals (100), and the power circuit (200) is electrically connected to the other power terminal (100); and
de_de: Elektrische Vorrichtung nach einem der Ansprüche 1 bis 3, wobei die Leistungsschaltung (200) elektrisch mit einem der Leistungsendgeräte (100) verbunden ist und die Leistungsschaltung (200) elektrisch mit dem anderen Leistungsendgerät (100) verbunden ist; und

source: a ground terminal (400) is further disposed on the substrate (600), the ground terminal (400) is disposed at intervals from the power terminals (100) along the first direction, and the ground terminal (400) is electrically connected to a grounding circuit (500).
de_de: auf dem Substrat (600) ferner ein Erdungsendgerät (400) angeordnet ist, das Erdungsendgerät (400) in Intervallen von den Leistungsendgeräten (100) entlang der ersten Richtung angeordnet ist und das Erdungsendgerät (400) elektrisch mit einer Erdungsschaltung (500) verbunden ist.

source: 1. A communication method for a terminal device (1600), comprising:
de_de: 1. Kommunikationsverfahren für ein Endgerät (1600), umfassend:

source: obtaining, a first synchronization signal block, SSB (S501) from a network device (1700);
de_de: Erhalten eines ersten Synchronisationssignalblocks, SSB (S501), von einer Netzwerkvorrichtung (1700);

source: sending, to the network device (1700), a random access preamble corresponding to the first SSB (S502), wherein the random access preamble is carried at a first time domain position, the first time domain position is associated with a timing offset value, wherein the timing offset value is determined by the network device (1700) based on a round-trip delay between the network device (1700) and a first position in an area covered by the network device (1700); and
de_de: Senden, an die Netzwerkvorrichtung (1700), einer Direktzugriffspräambel, die dem ersten SSB (S502) entspricht, wobei die Direktzugriffspräambel an einer ersten Zeitbereichsposition getragen wird, wobei die erste Zeitbereichsposition mit einem Zeitversatzwert verknüpft ist, wobei der Zeitversatzwert durch die Netzwerkvorrichtung (1700) basierend auf einer Umlaufverzögerung zwischen der Netzwerkvorrichtung (1700) und einer ersten Position in einem Bereich, der durch die Netzwerkvorrichtung (1700) abgedeckt ist, bestimmt wird; und

source: obtaining the first time domain position by offsetting a first moment based on the timing offset value, and the first moment is associated with the first SSB.
de_de: Erhalten der ersten Zeitbereichsposition durch Versetzen eines ersten Moments basierend auf dem Zeitversatzwert, und wobei das erste Moment mit dem ersten SSB verknüpft ist.

source: 2. The method according to claim 1, wherein the first moment comprises at least one of the following:
de_de: 2. Verfahren nach Anspruch 1, wobei das erste Moment mindestens eines der Folgenden umfasst:

source: an end moment of a time domain position of the first SSB;
de_de: ein Endmoment einer Zeitbereichsposition des ersten SSB;

source: a start moment of a time domain position of the first SSB;
de_de: ein Startmoment einer Zeitbereichsposition des ersten SSB;

source: an end moment of a slot in which a time domain position of the first SSB is located; or
de_de: ein Endmoment eines Schlitzes, in dem sich eine Zeitbereichsposition des ersten SSB befindet; oder

source: a start moment of a slot in which a time domain position of the first SSB is located.
de_de: ein Startmoment eines Schlitzes, in dem sich eine Zeitbereichsposition des ersten SSB befindet.

source: 3. The method according to claim 1 or 2, wherein the sending, a random access preamble corresponding to the first SSB comprises:
de_de: 3. Verfahren nach Anspruch 1 oder 2, wobei das Senden einer Direktzugriffspräambel, die dem ersten SSB entspricht, Folgendes umfasst:

source: sending, based on first information, the random access preamble corresponding to the first SSB, wherein the first information comprises at least one of the following:
de_de: Senden, basierend auf ersten Informationen, der Direktzugriffspräambel, die dem ersten SSB entspricht, wobei die ersten Informationen mindestens eines der Folgenden umfassen:

source: a time length of the first time domain position;
de_de: eine Zeitlänge der ersten Zeitbereichsposition;

source: a quantity of random access channel occasion, RO, resources comprised in the first time domain position, wherein the RO resource is used to carry the random access preamble; or
de_de: eine Anzahl von Direktzugriffskanalgelegenheits-, RO-, Ressourcen, die in der ersten Zeitbereichsposition umfasst sind, wobei die RO-Ressource verwendet wird, um die Direktzugriffspräambel zu tragen; oder

source: a quantity of SSBs corresponding to the first time domain position.
de_de: eine Anzahl von SSBs, die der ersten Zeitbereichsposition entsprechen.

source: 4. The method according to any one of claims 1 to 3, wherein
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei

source: the first time domain position is associated with the timing offset value and second information, and the second information comprises at least one of the following:
de_de: die erste Zeitbereichsposition mit dem Zeitversatzwert und zweiten Informationen verknüpft ist und die zweiten Informationen mindestens eines der Folgenden umfassen:

source: n first preset values, wherein n indicates an index position of the first SSB in an SSB set, and n is a natural number;
de_de: n erste voreingestellte Werte, wobei n eine Indexposition des ersten SSB in einem SSB-Satz angibt und n eine natürliche Zahl ist;

source: processing delay information;
de_de: Verarbeiten von Verzögerungsinformationen;

source: positioning error information; or
de_de: Positionieren von Fehlerinformationen; oder

source: ephemeris error information.
de_de: Ephemeridenfehlerinformationen.

source: 5. The method according to any one of claims 1 to 4, wherein
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 4, wobei

source: a value of the timing offset value is related to a value of an offset Koffset value, wherein the Koffset value is used to determine a scheduling interval of a physical uplink shared channel, PUSCH, signal.
de_de: ein Wert des Zeitversatzwerts mit einem Wert eines Versatz-Koffset-Werts in Beziehung steht, wobei der Koffset-Wert verwendet wird, um ein Planungsintervall eines Physical Uplink Shared Channel-, PUSCH-, Signals zu bestimmen.

source: 6. A communication method for a network device (1700), comprising:
de_de: 6. Kommunikationsverfahren für eine Netzwerkvorrichtung (1700), umfassend:

source: sending, a first synchronization signal block SSB, (S501) to a terminal device (1600);
de_de: Senden eines ersten Synchronisationssignalblocks, SSB, (S501) an ein Endgerät (1600);

source: obtaining, from the terminal device (1600), a random access preamble corresponding to the first SSB (S502), wherein the random access preamble is carried at a first time domain position, wherein the first time domain position is determined by the terminal device and is associated with a timing offset value; and
de_de: Erhalten, von dem Endgerät (1600), einer Direktzugriffspräambel, die dem ersten SSB entspricht (S502), wobei die Direktzugriffspräambel an einer ersten Zeitbereichsposition getragen wird, wobei die erste Zeitbereichsposition durch das Endgerät bestimmt wird und mit einem Zeitversatzwert verknüpft ist; und

source: determining the timing offset value based on a round-trip delay between the network device (1700) and a first position in an area covered by the network device (1700); wherein the first time domain position is obtained by the terminal device (1600) by offsetting a first moment based on the timing offset value, and the first moment is associated with the first SSB.
de_de: Bestimmen des Zeitversatzwerts basierend auf einer Umlaufverzögerung zwischen der Netzwerkvorrichtung (1700) und einer ersten Position in einem Bereich, der durch die Netzwerkvorrichtung (1700) abgedeckt wird; wobei die erste Zeitbereichsposition durch das Endgerät (1600) durch Versetzen eines ersten Moments basierend auf dem Zeitversatzwert erhalten wird und das erste Moment mit dem ersten SSB verknüpft ist.

source: 7. The method according to claim 6, wherein the first moment comprises at least one of the following:
de_de: 7. Verfahren nach Anspruch 6, wobei das erste Moment mindestens eines der Folgenden umfasst:

source: 8. The method according to claim 6 or 7, wherein the obtaining, a random access preamble corresponding to the first SSB comprises:
de_de: 8. Verfahren nach Anspruch 6 oder 7, wobei das Erhalten einer Direktzugriffspräambel, die dem ersten SSB entspricht, Folgendes umfasst:

source: obtaining, based on first information, the random access preamble corresponding to the first SSB, wherein the first information indicates at least one of the following:
de_de: Erhalten, basierend auf ersten Informationen, der Direktzugriffspräambel, die dem ersten SSB entspricht, wobei die ersten Informationen mindestens eines der Folgenden angeben:

source: 9. The method according to any one of claims 6 to 8, wherein
de_de: 9. Verfahren nach einem der Ansprüche 6 bis 8, wobei

source: The method according to any one of claims 6 to 9, wherein
de_de: Verfahren gemäß einem der Ansprüche 6 bis 9, wobei

source: An apparatus configured to cause a terminal device (1600) to perform any of the methods according to claims 1 to 5.
de_de: Vorrichtung, die konfiguriert ist, um ein Endgerät (1600) zu veranlassen, eines der Verfahren nach den Ansprüchen 1 bis 5 durchzuführen.

source: An apparatus configured to cause a network device (1700) to perform any of the methods according to claims 6 to 10.
de_de: Vorrichtung, die konfiguriert ist, um eine Netzwerkvorrichtung (1700) zu veranlassen, eines der Verfahren nach den Ansprüchen 6 bis 10 durchzuführen.

source: A computer-readable storage medium comprising instructions which, when executed by a computer, cause the computer to carry out the method according to any one of claims 1 to 10.
de_de: Computerlesbares Speichermedium, das Anweisungen umfasst, die, wenn sie von einem Computer ausgeführt werden, den Computer veranlassen, das Verfahren nach einem der Ansprüche 1 bis 10 vorzunehmen.

source: 1. A communication method, applied to a first access network device, wherein the method comprises:
de_de: 1. Kommunikationsverfahren, das auf eine erste Zugriffsnetzwerkvorrichtung angewendet wird, wobei das Verfahren Folgendes umfasst:

source: obtaining small data transmission, SDT, failure information;
de_de: Erlangen von Fehlerinformationen über eine Übertragung kleiner Datenmengen (SDT);

source: releasing an access stratum, AS, context of a terminal device based on the SDT failure information; and
de_de: Freigeben eines Access-Stratum-(AS-)Kontexts eines Endgeräts basierend auf den SDT-Fehlerinformationen; und

source: sending a first request message to a core network device, wherein the first request message comprises the SDT failure information, and the first request message is used to request the core network device to release a non-access stratum, NAS, context of the terminal device.
de_de: Senden einer ersten Anforderungsnachricht an eine Kernnetzwerkvorrichtung, wobei die erste Anforderungsnachricht die SDT-Fehlerinformationen umfasst, und die erste Anforderungsnachricht verwendet wird, um die Kernnetzwerkvorrichtung aufzufordern, einen Non-Access-Stratum-(NAS-)Kontext des Endgeräts freizugeben.
